/******************** (C) COPYRIGHT  风驰iCreate嵌入式开发工作室 **************
 * 文件名  ：tim2.h
 * 描述    ：TIM2定时、PWM功能设置函数库   
 * 实验平台：风驰STM8开发板
 * 库版本  ：V2.1.0
 * 作者    ：风驰  QQ：779814207
 * 博客    ：
 * 淘宝    ：http://shop71177993.taobao.com/
 *修改时间 ：2012-11-12

  风驰STM8开发板硬件连接
    |-------------------------|
    |  蜂鸣器 - PD4(TIM2_CH1) |
    |-------------------------|

*******************************************************************************/
#ifndef __TIM2_H
#define __TIM2_H

/* 包含系统头文件 */

/* 包含自定义头文件 */
#include "stm8s.h"
#include "stm8s_tim2.h"

/* 自定义数据类型 */

/* 自定义常量宏和表达式宏 */
#define PWM        0
#define BaseTime   1
#define TIM2_Mode  0		/* 要测试TIM2的哪种模式 */



/* 声明给外部使用的变量 */

/* 声明给外部使用的函数 */

/*******************************************************************************
 * 名称: Tim2_Timer_Init
 * 功能: TIM2定时器初始化操作
 * 形参: 无
 * 返回: 无
 * 说明: 无 
 ******************************************************************************/
void Tim2_Timer_Init(void);

/*******************************************************************************
 * 名称: TimingDelay_Decrement
 * 功能: 延时计数变量自减操作
 * 形参: 无
 * 返回: 无
 * 说明: 无 
 ******************************************************************************/
void TimingDelay_Decrement(void);

/*******************************************************************************
 * 名称: Delay_ms
 * 功能: 延时函数
 * 形参: n10ms -> 以10ms为间隔进行延时
 * 返回: 无
 * 说明: 无 
 ******************************************************************************/
void Delay_ms(u16 n10ms);

/*******************************************************************************
 * 名称: TIM2_PWM_Init
 * 功能: TIM2初始化函数
 * 形参: 无
 * 返回: 无
 * 说明: 无 
 ******************************************************************************/
void TIM2_PWM_Init(void);

/*******************************************************************************
 * 名称: Set_TIM2_PWM_Frequency
 * 功能: 设置TIM2-PWM频率
 * 形参: TIM2_Period -> 要设置的频率
 * 返回: 无
 * 说明: 无 
 ******************************************************************************/
void Set_TIM2_PWM_Frequency(uint16_t TIM2_Period);

/*******************************************************************************
 * 名称: Set_TIM2_PWM1_DutyCycle
 * 功能: 设置TIM2-PWM通道1占空比
 * 形参: TIM2_Pulse -> 要设置的占空比
 * 返回: 无
 * 说明: 无 
 ******************************************************************************/
void Set_TIM2_PWM1_DutyCycle( uint16_t TIM2_Pulse);

/*******************************************************************************
 * 名称: Set_TIM2_PWM2_DutyCycle
 * 功能: 设置TIM2-PWM通道2占空比
 * 形参: TIM2_Pulse -> 要设置的占空比
 * 返回: 无
 * 说明: 无 
 ******************************************************************************/
void Set_TIM2_PWM2_DutyCycle( uint16_t TIM2_Pulse);

/*******************************************************************************
 * 名称: Test_PWM_Beep
 * 功能: 测试通道1
 * 形参: 无
 * 返回: 无
 * 说明: 无 
 ******************************************************************************/
void Test_PWM_Beep(void);

static void Delay(u32 nCount);
#endif


/******************* (C) COPYRIGHT 风驰iCreate嵌入式开发工作室 *****END OF FILE****/